<template>
  <div>
    <h3>节流</h3>
    <p>
      解决因为频繁触发事件而浏览器卡顿的另一个方法：节流。
    </p>
    <p style="text-indent: 50px;">
      节流的原理：如果你持续触发事件，每隔一段时间，只执行一次事件。
      根据首次是否执行以及结束后是否执行，效果有所不同，实现的方式也有所不同。
      用leading代表首次是否执行，用trailing代表结束后是否再执行一次。
      关于节流的实现，有两种主流的实现方式，一种是使用时间戳，一种是设置定时器。
    </p>
    <p>
      使用时间戳：
    </p>
    <p style="text-indent: 50px;">
      当触发事件时，取出当前的时间戳，然后减去之前的时间戳（最一开始值设为0），如果大于设置的周期，就执行一次函数，
      然后更新时间戳为当前时间戳，如果小于就不执行。
    </p>
    <p>
      使用定时器：
    </p>
    <p style="text-indent: 50px;">
      当触发事件的时候，设置一个定时器，再触发事件的时候，如果定时器存在就不执行，
      直到定时器执行，然后执行函数，清空定时器，这样就可以设置下一个定时器。
    </p>
  </div>
</template>
<script>
export default {
  name: 'MyThrottle'
}
</script>
